"""KeyError -> дава грешка, когато ключ за съпоставяне не е намерен в набора от съществуващи ключове на съпоставянето

AttributeError -> дава грешка, когато се направи невалидна препратка към атрибут

ValueError -> дава грешка, когато на обект е присвоена грешна стойност. Това може да се случи, ако стойността е невалидна за дадена операция или ако стойността не съществува.

NameError -> дава грешка, когато се опитате да използвате променлива, функция или модул, които не съществуват или не са използвани по валиден начин.

TypeError -> дава грешка, когато типът данни на обект в операция е неподходящ.

IndexError -> дава грешка, когато се направи опит за достъп до елемент от списък, който е извън обхвата на индекса на списъка.

ModuleNotFoundError -> дава грешка, когато не може успешно да импортира модул.

ZeroDivisionError -> дава грешка, когато се опитаме да разделим число с плаваща запетая на 0

RuntimeError -> просто означава някаква грешка, която се открива само по време на изпълнение, а не когато софтуерът е проектиран

FileNotFoundError -> дава грешка, когато файл или директория е поискан, но не съществува

OSError -> дава грешка, когато специфична системна функция на операционната система върне свързана със системата грешка, включително входно/изходни грешки като „файлът не е намерен“ или „дискът е пълен"""

